#pragma once
#ifndef BPSK_FAC
#define BPSK_FAC



double G_bpsk(double f, double Fc);

/*************************************************
生成BPSK序列
m是一个码元时间里有多少正弦信号周期的时间，BUFF是存储bpsk的
数组的指针，n表示有多少个码元，size是数组的大小，Ut是扩频码序列
***************************************************/
void Gene_bpsk(int m, double * BUFF, int n, int size, double * TM, int *Ut);


/**************************************************
打印BPSK序列
**************************************************/
void Print_bpsk(double * BUFF, int size, double * TM);


/***********************************************
生成BPSK的功率谱序列
b是m的值，P_BPSK是bpsk序列的值，size是数组大小
************************************************/
void P_bpsk(int m, double * P_BPSK, int size, double * Fx);


/***********************************************
打印BPSK的功率谱序列
*************************************************/
void Print_P_bpsk(int m, double * P_BPSK, int size, double * Fx);


/***********************************************
BPSK的自相关函数
************************************************/
void Self_bpsk_func(int m, double * SELF_BUFF, int size, double * TM);


/************************************************
打印BPSK的自相关函数
*************************************************/
void Print_bpsk_self(double *SELF_BUFF, double * TM, int size);





/***********************************************
带限之后的剩余功率谱密度
Br是预定义带宽，b是m
*************************************************/
double Lamda_bpsk(double Br, int M);

/***********************************************
βr在带限之后的自相关函数
************************************************/
void Left_self_bpsk(double Br, int m, double * BUFF, int size, double *TM);

/**********************************************
打印带限时候的自相关函数
***********************************************/
void Print_left_self_bpsk(int m, double * BUFF, int size, double * TM);



/**********************************************
均方根带宽RMS
***********************************************/
double RMS_bpsk(int M, double Br);

/*********************************************
功率谱密度Gs(f)的有效矩形带宽βrect
**********************************************/
double RECT_bpsk(int m, double Br);

/********************************************
求BPSK功率谱主瓣的最大功率谱密度
*********************************************/
double Max_power_bpsk(int m, double Br);


/********************************************
带外损失功率
*********************************************/
double LOSS_power_bpsk(int m, double Br);

/*********************************************
计算BPSK90%功率的带宽
**********************************************/
double Band_width_0_9_bpsk(int m, double Br);




#endif // !BPSK_FAC
#pragma once
